Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.BuiltupEnum
The builtup settings.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.BuiltupEnum.BUILTUP_AUTO
The "auto" builtup setting.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.BuiltupEnum.BUILTUP_NONE
The "none" builtup setting.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.BuiltupEnum.BUILTUP_MAIN_PART
The "main part" builtup setting.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.BuiltupEnum.BUILTUP_SUB_PART
The "sub part" builtup setting.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.BuiltupEnum.BUILTUP_SUB_PART_BEAM
The "part beam" builtup setting.

Tekla.Structures.Analysis.AnalysisPartAnalysisProperties.BuiltupEnum.BUILTUP_SUB_PART_COLUMN
The "sub part column" builtup setting.